Revit 2023 API
SchedulableField Methods
The SchedulableField type exposes the following members.
Methods
Name | Description
Dispose
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets the integer value of the SchedulableField as hash code
 (Overrides Object.GetHashCode().)
GetName
 Gets the name of the field.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
SchedulableField Class
Autodesk.Revit.DB Namespace